BEGIN {
    print "# BG7XTQ的电台日志"
    print
    print "| 序号 | 日期 | 开始时间(UTC) | 结束时间(UTC) | 呼号 | 接收频率(MHz) | 发射频率(MHz) | 模式 | RST(发送) | RST(接收) | 功率W(我的) | 功率W(对方) | 摘要 | QSL卡片(发) | QSL卡片(收) |"
    print "| :--: | :--: | :---: | :----: | :---: | :--: | :--: | :--: | :-----: | :-----: | :--: | :--: | :--: | :--: | :--: |"
}
NR > 1 {
    split($34, date, ".");
    split($49, time_on, ":");
    split($50, time_off, ":");
    # $6 呼号
    # $20 模式
    # $23 摘要
    # $34 日期
    # $36 接收信号报告
    # $37 发送信号报告
    # $38 对方功率
    # $51 我的功率
    printf "| %u | %u/%u/%u | %u:%02u | %u:%02u | %s | %.3f | %.3f | %s | %3s | %3s | %s | %s | %s | %s | %s |\n", $62, date[1], date[2], date[3], time_on[1], time_on[2], time_off[1], time_off[2], $6, $58, $14, $20, $37, $36, $51, $38, $23, ($28 == "Y" ? "✓" : ""), ($27 == "Y" ? "✓" : "")
}
END {
    printf "\n"
}
